#+PROPERTY: header-args:R :session *R-celtis* :dir /home/smithty/nextcloud/celtis-bkup/celtis-manuscript
#+TITLE: Mixed-ploidy STRUCTURE analysis
#+LAST_MODIFIED: [2021-11-22 Mon 17:13]

* Run parameters:

Important! Need to set ~#define RECESSIVEALLELES 1~ in [[./mainparams]]. 

Highlighted in citep:MeirmansEtAl_2018; this directs STRUCTURE to ignore
dosage information (which is artificially generated on export from R, and
we don't know in any case), and to incorporate dosage uncertainty in the
analysis. Not needed for diploid-only analysis, where the dosage is known
exactly.

Note that the header for ~allPloidy.stru~ contains a line of missing
values. This indicates that we don't know which alleles are recessive, so
STRUCTURE needs to incorporate this uncertainty into the analysis.

#+begin_src bash :results output verbatim
  head -6 allPloidy.stru ## show the header and first diploid sample
  tail -4 allPloidy.stru ## show the final tetraploid sample
#+end_src

#+RESULTS:
: 		loc16	loc20	loc22	loc28	loc30	loc31	loc36	loc38
: 		-9	-9	-9	-9	-9	-9	-9	-9
: MOCC1	3	270	244	369	194	226	465	443	334
: MOCC1	3	287	268	379	206	226	470	449	334
: MOCC1	3	-9	-9	-9	-9	-9	-9	-9	-9
: MOCC1	3	-9	-9	-9	-9	-9	-9	-9	-9
: SCCC5	7	270	-9	369	200	-9	465	443	334
: SCCC5	7	281	-9	376	206	-9	470	449	340
: SCCC5	7	287	-9	381	212	-9	465	443	346
: SCCC5	7	270	-9	369	200	-9	465	443	334

MOCC1 is a diploid, so has two 'missing' alleles at each locus. SCCC5 is
one of the tetraploids. Note that R has filled in the uncertain alleles
with the first allele. This isn't a real call, and STRUCTURE will ignore
the actual value and consider it as ambiguous.

